In [1]:
import pandas as pd
import numpy as np

### EDA (Exploratory Data Analysis)

In [12]:
df=pd.read_csv(r"C:\Users\admin\Desktop\Salary_Data.csv")
df.head(3)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0

In [13]:
df.shape

(30, 2)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [15]:
df.size #Total cells in your column just like np array

60

In [16]:
#Description of numerical Information
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [19]:
df['Salary'].mean()

76003.0